teslabs/pebble-firmware/src/fw/drivers/nrf5/qspi.c
  flash_suf = (length - flash_pre) % WORD_SIZE;
  flash_mid = length - flash_pre - flash_suf;

  // write words from RAM to aligned flash
  if (flash_mid != 0U) {
    if (!nrfx_is_word_aligned(bufferp + flash_pre)) {
      // If middle words are not aligned, we need to copy them to a bounce buffer
      const uint8_t *curr_bufferp = bufferp + flash_pre;
      uint32_t curr_addr = addr + flash_pre;
      uint32_t remaining = flash_mid;

      while (remaining > 0U) {
        uint32_t chunk_length = MIN(remaining, sizeof(s_io_bounce_buffer));

        memcpy(s_io_bounce_buffer, curr_bufferp, chunk_length);

        res = nrfx_qspi_write(s_io_bounce_buffer, chunk_length, curr_addr);
        prv_wait_for_completion(dev);
        if (res != NRFX_SUCCESS) {
          return E_ERROR;
        }

        remaining -= chunk_length;
        curr_bufferp += chunk_length;
        curr_addr += chunk_length;
      }
    } else {
      res = nrfx_qspi_write(bufferp + flash_pre, flash_mid, addr + flash_pre);
      prv_wait_for_completion(dev);
      if (res != NRFX_SUCCESS) {
        return E_ERROR;
      }
    }
  }

  // write prefix (sub-word)
  if (flash_pre != 0U) {
    res = nrfx_qspi_read(s_io_bounce_buffer, WORD_SIZE, addr - (addr % WORD_SIZE));
    prv_wait_for_completion(dev);
    if (res != NRFX_SUCCESS) {
      return E_ERROR;
    }

    memcpy(s_io_bounce_buffer + WORD_SIZE - flash_pre, bufferp, flash_pre);

    res = nrfx_qspi_write(s_io_bounce_buffer, WORD_SIZE, addr - (addr % WORD_SIZE));
    prv_wait_for_completion(dev);
    if (res != NRFX_SUCCESS) {
      return E_ERROR;
    }
  }

  // write suffix (sub-word)
  if (flash_suf != 0U) {
    res = nrfx_qspi_read(s_io_bounce_buffer, WORD_SIZE, addr + flash_pre + flash_mid);
    prv_wait_for_completion(dev);
    if (res != NRFX_SUCCESS) {
      return E_ERROR;
    }

    memcpy(s_io_bounce_buffer, bufferp + flash_pre + flash_mid, flash_suf);

    res = nrfx_qspi_write(s_io_bounce_buffer, WORD_SIZE, addr + flash_pre + flash_mid);
    prv_wait_for_completion(dev);
    if (res != NRFX_SUCCESS) {
      return E_ERROR;
    }
  }

  return (int)length;
}

int qspi_flash_write_page_begin(QSPIFlash *dev, const void *buffer, uint32_t addr,
                                uint32_t length) {
  int ret;

  prv_write_protection_set(dev, false);

  if (!nrfx_is_in_ram(buffer)) {
    // If buffer is not in RAM, use a bounce buffer
    ret = S_SUCCESS;
    const uint8_t *curr_buffer = buffer;
    uint32_t curr_addr = addr;
    uint32_t remaining = length;

    while ((remaining > 0U) && (ret == S_SUCCESS)) {
      uint32_t chunk_length = MIN(remaining, sizeof(s_flash_bounce_buffer));

      memcpy(s_flash_bounce_buffer, curr_buffer, chunk_length);
      ret = prv_flash_write_unaligned(dev, s_flash_bounce_buffer, curr_addr, chunk_length);

      if (ret != E_ERROR) {
        remaining -= chunk_length;
        curr_buffer += chunk_length;
        curr_addr += chunk_length;
      }
    }

    if (ret != E_ERROR) {
      ret = (int)length;
    }
  } else {
    ret = prv_flash_write_unaligned(dev, buffer, addr, length);
  }

  prv_write_protection_set(dev, true);

  return ret;
}

status_t qspi_flash_get_write_status(QSPIFlash *dev) {
  return nrfx_qspi_mem_busy_check() == NRFX_SUCCESS ? S_SUCCESS : E_BUSY;
}

void qspi_flash_set_lower_power_mode(QSPIFlash *dev, bool active) {
  uint8_t instruction;
  uint32_t delay;
  if (active) {
    instruction = dev->state->part->instructions.enter_low_power;
    delay = dev->state->part->standby_to_low_power_latency_us;
  } else {
    instruction = dev->state->part->instructions.exit_low_power;
    delay = dev->state->part->low_power_to_standby_latency_us;
  }
  prv_write_cmd_no_addr(dev->qspi, instruction);
  if (delay) {
    delay_us(delay);
  }
}

static bool prv_blank_check_poll(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  const uint32_t size_bytes = is_subsector ? SUBSECTOR_SIZE_BYTES : SECTOR_SIZE_BYTES;
  const uint32_t BUF_SIZE_BYTES = 128;
  const uint32_t BUF_SIZE_WORDS = BUF_SIZE_BYTES / sizeof(uint32_t);
  uint32_t buffer[BUF_SIZE_WORDS];
  for (uint32_t offset = 0; offset < size_bytes; offset += BUF_SIZE_BYTES) {
    flash_impl_read_sync(buffer, addr + offset, BUF_SIZE_BYTES);
    for (uint32_t i = 0; i < BUF_SIZE_WORDS; ++i) {
      if (buffer[i] != FLASH_RESET_WORD_VALUE) {
        return false;
      }
    }
  }
  return true;
}

status_t qspi_flash_blank_check(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  const bool result = prv_blank_check_poll(dev, addr, is_subsector);
  return result ? S_TRUE : S_FALSE;
}

void qspi_flash_ll_set_register_bits(QSPIFlash *dev, uint8_t read_instruction,
                                     uint8_t write_instruction, uint8_t value, uint8_t mask) {
  // make sure we're not trying to set any bits not within the mask
  PBL_ASSERTN((value & mask) == value);

  // first read the register
  uint8_t reg_value;
  prv_read_register(dev->qspi, read_instruction, &reg_value, 1);

  // set the desired bits
  reg_value = (reg_value & ~mask) | value;

  // enable writing and write the register value
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.write_enable);
  qspi_indirect_write_no_addr(dev->qspi, write_instruction, &reg_value, 1);
}

status_t qspi_flash_write_protection_enable(QSPIFlash *dev) { return S_NO_ACTION_REQUIRED; }

status_t qspi_flash_lock_sector(QSPIFlash *dev, uint32_t addr) { return S_SUCCESS; }

status_t qspi_flash_unlock_all(QSPIFlash *dev) { return S_SUCCESS; }

#if !RELEASE
#include "console/prompt.h"
#include "drivers/flash.h"
#include "kernel/pbl_malloc.h"
#include "system/profiler.h"
#include "util/size.h"

static bool prv_flash_read_verify(QSPIFlash *dev, int size, int offset) {
  bool success = true;

  profiler_start();
  // prv_read_mmap(dev, 0, buffer_mmap, size);
  profiler_stop();
  uint32_t mmap_time = profiler_get_total_duration(true);

  const int buf_size = 64;
  char buf[buf_size];
  prompt_send_response_fmt(buf, buf_size, "Size: %d UNIMPL: MMP: %" PRIu32, size, mmap_time);

  return success;
}

struct FlashReadTestValues {
  int size;
  int offset;
};

const struct FlashReadTestValues FLASH_READ_TEST_TABLE[] = {
    {.size = 1024, .offset = 0}, {.size = 1025, .offset = 0}, {.size = 1026, .offset = 0},
    {.size = 1027, .offset = 0}, {.size = 1024, .offset = 1}, {.size = 1025, .offset = 2},
    {.size = 1026, .offset = 3}, {.size = 4, .offset = 0},    {.size = 20, .offset = 0},
    {.size = 60, .offset = 0},   {.size = 127, .offset = 0},  {.size = 128, .offset = 0},
};

void command_flash_apicheck(const char *len_str) {
  QSPIFlash *dev = QSPI_FLASH;
  const int buf_size = 64;
  char buf[buf_size];
  int failures = 0;
  int passes = 0;

  profiler_init();

  prompt_send_response("Check whoami");
  if (!qspi_flash_check_whoami(dev)) {
    ++failures;
    prompt_send_response("ERROR: Who am I failed");
  } else {
    ++passes;
  }

  prompt_send_response("Enter low power mode");
  flash_impl_enter_low_power_mode();

  // WHOAMI should fail in low-power mode
  prompt_send_response("Check whoami, should fail in low power mode");
  if (qspi_flash_check_whoami(dev)) {
    ++failures;
    prompt_send_response("ERROR: Who am I failed");
  } else {
    ++passes;
  }

  prompt_send_response("Exit low power mode");
  flash_impl_exit_low_power_mode();

  prompt_send_response("Start flash_read_verify test");

  const int final_size = atoi(len_str);

